app/views/tasks/show.html.haml

  .notes
    - @task.notes.each do |note|
---
SELECT "notes".* FROM "notes" WHERE "notes"."task_id" = $1  [["task_id", 3]]