app/controllers/tasks/notes_controller.rb

    def create
        @note = @task.notes.new(note_params)
        @note.user = current_user
        @note.save
---
INSERT INTO "notes" ("body", "user_id", "task_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "sdfsdf"], ["user_id", 10], ["task_id", 5], ["created_at", "2022-12-07 23:05:28.468694"], ["updated_at", "2022-12-07 23:05:28.468694"]]

    def set_task
        @task = Task.find(params[:task_id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]